# 1
a = int(input('Введіть ціле число1:'))
b = int(input('Введіть ціле число2:'))
c = float(input('Введіть  дріб1:'))
d = float(input('Введіть  дріб2:'))
# 2
e1 = (a + b)
e2 = round(c - d, 3)
e3 = round(b * c, 3)
e4 = (d / a)
e5 = round(a ** c, 3)
e6 = (b // d)
e7 = round(d % b, 3)
nl = [e1, e2, e3, e4, e5, e6, e7]
print('Результат:', nl)
# 3
print('Kількість елементів списку: ', len(nl))
print('Список парних елементів:', nl[1::2])
# 4
f2 = nl[1]
nl[1] = nl[4]
nl[4] = f2
print('Список із зміненими елементами:', nl)
# 5
name = input("Введіть ПІБ: ")
print(
    f'Висновок по лабораторній роботі №1 виконала {name} \n Висновок: В ході виконання лабораторної  '
    f'роботи я ознайомилася з алгоритмами послідовної \n '
    '(лінійної) структури, з процедурами запуску програм, які реалізують ці алгоритми на '
    'мові Python.\n '
    'Також ознайомилась із інтегрованим середовищем розробки IDLE.\n ')
